run/icoPhaseChangeVoF/testLaser/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.02;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDiCo         1000.0;
maxDeltaT       1;

// ************************************************************************* //

DebugSwitches
{
    laserDTRM   1;
    reflectionModel 1;
}

OptimisationSwitches
{
    fileHandler collated;
}